Repository: kladda87/synaptic
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sv

source: SYNAPTIC - about our clinic
sv: SYNAPTIC - om vår klinik

source: About us
sv: Om oss

source: Welcome to Synaptic MindCare – A New Perspective on Mental Health and Recovery
sv: Välkommen till Synaptic MindCare – Ett nytt perspektiv på mental hälsa och återhämtning

source: Located in the picturesque landscape of Greece, Synaptic MindCare is redefining psychiatric care by introducing a holistic model that encompasses a broad spectrum of psychiatric conditions, including treatments for treatment-resistant depression, anxiety, geriatric psychiatry, and integrated substance use care. By acknowledging the intricate link between mental health conditions and the individual and social factors influencing them, we aim to provide care that comprehensively addresses the whole person.
sv: Vid Synaptic MindCare, beläget i det vackra Grekland, omdefinierar vi tillgången till psykiatrisk vård genom att erbjuda en holistisk vårdmodell som adresserar ett brett spektrum av psykiatriska tillstånd, inklusive behandlingar för terapiresistent depression ångest, äldrepsykiatri, samt beroendevård som en integrerad del av vårt tjänsteutbud. Genom att erkänna det djupa sambandet mellan psykiskatillstånd och de individuella och sociala faktorer som påverkar dem, strävar vi efter att erbjuda en vård som ser och behandlar hela människan.

source: Our approach is grounded in the belief that each individual is unique, leading us to offer flexible and personalized treatment plans. Our team, composed of experts with a wide range of experience in psychiatric conditions, is committed to delivering compassionate and effective care. Our medical professionals, including doctors, psychologists, and nurses, are all trained in contemporary psychiatric and substance use care therapies, ensuring a non-judgmental and empathetic treatment environment.
sv: Vår filosofi bygger på att varje person är unik, vilket återspeglas i vårt flexibla och kontinuerligt anpassade behandlingsutbud. Vårt team av specialister har bred erfarenhet över ett omfattande spektrum av psykiatriska tillstånd. Vi är stolta över att kunna erbjuda en medkännande och effektiv vård, där läkare, psykologer och sjuksköterskor, utbildade i modern psykiatri och specialiserade på bland annat beroendevård, arbetar utan pekpinnar eller moraliserande attityder.

source: We are equipped to manage both general and neuropsychiatric conditions, understanding the complexity of these issues and their mutual impact.
sv: Vi tar oss an utmaningen att behandla allmänna och neuropsykiatriska tillstånd med en förståelse för dessa tillstånds komplexitet och inbördes påverkan.

source: We are equipped to manage both general and neuropsychiatric conditions, understanding the complexity of these issues and their mutual impact. This enables us to formulate holistic treatment plans that target not just the symptoms but also the root causes, whether it's anxiety, depression, ADHD, or other psychiatric diagnoses. Additionally, our substance use treatment is seamlessly integrated into our overall care, customized to meet the specific needs of each individual without being the focal point of our services.
sv: Vi tar oss an utmaningen att behandla allmänna och neuropsykiatriska tillstånd med en förståelse för dessa tillstånds komplexitet och inbördes påverkan. Detta innebär att vi kan erbjuda holistiska behandlingsplaner som inte bara fokuserar på symptomen utan också på de underliggande orsakerna, oavsett om det handlar omångest, depression, ADHD eller andra psykiatriska diagnoser. Inom ramen för detta erbjuder vi även behandling för beroende som en del av vår omfattande vård, skräddarsydd för att möta individuella behov utan att det är huvudfokuset för vårverksamhet.

source: As the currently sole Swedish concept for substance use treatment outside of the regional clinics, Synaptic MindCare distinguishes itself by providing comprehensive psychiatric care, including access to innovative treatments like ketamine therapy for treatment-resistant depression. This capability is enhanced by our partnership with the GALENE clinic, established in 1971 and renowned for its world-class psychiatric services.
sv: Som det för närvarande enda svenska beroendekonceptet utanför regionens egna beroendekliniker, skiljer sig Synaptic MindCare genom att erbjuda en fullständig psykiatrisk behandling, inklusive tillgång till ketaminbehandling mot terapiresistent depression. Detta unika tillvägagångssätt är möjligt tack vare vårtsamarbete med GALENE-kliniken, grundad 1971, känd för sin psykiatriska vård i världsklass.

source: Committed to staying at the forefront of research and advancements in our field, we ensure our clients receive the most effective, evidence-based treatments available.
sv: Dedikerade till att följa den senaste forskningen och utvecklingen inom våra fält, säkerställer vi att våra klienter får tillgång till de mest effektiva och evidensbaserade behandlingsmetoderna.

source: Committed to staying at the forefront of research and advancements in our field, we ensure our clients receive the most effective, evidence-based treatments available. Our mission is to guide each individual towards not just recovery, but a richer, more meaningful life.
sv: Dedikerade till att följa den senaste forskningen och utvecklingen inom våra fält, säkerställer vi att våra klienter får tillgång till de mest effektiva och evidensbaserade behandlingsmetoderna. Vår målsättning är att erbjuda en väg tillinte bara återhämtning utan också till ett mer uppfyllande och meningsfullt liv.

source: Synaptic MindCare is here to accompany you on your journey towards recovery and self-discovery. We recognize that improving mental health is a deeply personal journey, fraught with challenges but also filled with opportunities. Our dedicated team is ready to provide the support and expertise needed at every step of your journey. For a closer look at the environment we offer our patients, you are welcome to read more about our collaboration with the GALENE clinic and view pictures on their website.
sv: Synaptic MindCare är din partner på resan mot återhämtning och självupptäckt. Vi förstår att vägen till bättre mental hälsa är personlig, fylld med utmaningar och möjligheter. Vår tillgänglighet, omsorg och expertis finns där för att stödja dig genom varje steg på vägen. Du kan läsa mer om vårt samarbete med GALENE-kliniken och se bilder på deras hemsida, för att få en känsla av den miljö vierbjuder våra patienter.

source: GALENE's website
sv: GALENEs hemsida

source: Contact Us - succeeded!
sv: Kontakta oss - lyckades!

source: Thank you for contacting us!
sv: Tack för att du kontaktar oss!

source: We have sent a confirmation mail to
sv: Vi har skickat ett bekräftelsemail till

source: We'll get back to you shortly.
sv: Vi återkommer till dig inom kort.

source: Back to homepage
sv: Tillbaka till huvudsidan

source: Contact us
sv: Kontakta oss

source: Contact Us
sv: Kontakta oss

source: Fields marked with * are mandatory
sv: Fält markerade med * är obligatoriska

source: First Name*
sv: Tilltalsnamn*

source: Surname*
sv: Efternamn*

source: Email Address*
sv: Email*

source: Phone Number
sv: Telefonnummer

source: Message*
sv: Meddelande*

source: Send
sv: Skicka

source: Welcome to Synaptic
sv: Välkommen till Synaptic

source: About Us
sv: Om oss

source: We are newly started clinic through the collaboration between Swedish and Greek psychiatrist with decades of experience in treating addiction.
sv: Vi är en nystartad klinik genom ett samarbete mellan svenska och grekiska psykiatriker med mångårig erfarenhet av beroendebehandling.

source: Our center is hosted within the
sv: Vår verksamhet hyr in sig hos

source: GALENE clinic facilities
sv: GALENE-kliniken

source: , in the north-east of Athens. Our staff is highly qualified and experienced, and our treatment program is tailored to the individual needs of each patient.
sv: , i nord-östra Aten. Våra medarbetare är kvalificerade, erfarna och våra behandlingsprogram specialanpassade efter varje patients behov.

source: Meet Our Staff
sv: Medarbetare

source: We have some of the most experienced and renowned psychiatrists in our team. With decades of treating addiction and other related conditions, they can help providing solutions where other clinics have failed.
sv: Vi har några av de mest erfarna och kända psykiatrikerna i vårt team. Med årtionden av erfarenhet av att behandla beroende och relaterade sjukdomar kan de hjälpa till att hitta lösningar där andra kliniker inte har lyckats.

source: Frequently Asked Questions
sv: Vanliga frågor

source: We understand that you may have questions about our center and treatment programs. Please visit our
sv: Vi förstår att du kan ha frågor om vår klinik och behandlingar. Vänligen se vår

source: FAQ page
sv: FAQ-sida

source: for more information.
sv: för mer information.

source: News
sv: Nyheter

source: Synaptic - our staff
sv: Synaptic - våra medarbetare

source: Our treatments
sv: Våra behandlingar

source: At Synaptic Mindcare, we offer tailored treatment programs that span a wide spectrum of psychiatric diagnoses, including depression, anxiety, neuro-psychiatric disorders, geriatric psychiatry and addictive disorders.
sv: På Synaptic MindCare erbjuder vi skräddarsydda vårdprogram som omfattar ett brett spektrum av psykiatriska tillstånd, inklusive svårbehandlad depression, ångest, neuropsykiatriska störningar, äldrepsykiatri och beroendetillstånd.

source: Our treatments include evidence-based methods that are always adapted to each patient’s specific and unique needs and development. Our team has a rich and broad competence and long experience, with backgrounds in both Sweden and Greece. By integrating different fields of expertise, we ensure that each patient receives thorough and empathetic care on their journey to recovery.
sv: Vår behandling inkluderar evidensbaserade metoder, alltid anpassade efter patientens unika behov och utveckling. Vårt team är rikt påmångsidig kompetens och lång erfarenhet, med bakgrund från både Sverige och Grekland. Genom att integrera olika expertiser säkerställer vi en omfattande och empatisk vård för varje individ påderas resa mot återhämtning.

source: Treatments
sv: Behandlingar

source: Pharmacological treatment for difficult-to-treat depression, anxiety, neuro-psychiatric disorders, geriatric psychiatry and addictive disorders.
sv: Farmakologisk behandling mot svårbehandlad depression, ångest, neuropsykiatriska tillstånd, äldrepsykiatri och beroendesjukdomar.

source: Oral pharmacological treatment for difficult-to-treat depression, ketamine IV or ECT.
sv: Farmakologisk behandling mot svårbehandlad depression i tablettform, ketamin IV alternativt ECT.

source: Withdrawal treatment for various addictive disorders.
sv: Abstinens behandling vid olika beroendetillstånd.

source: Regular testing to ensure patient safety.
sv: Regelbundna provtagningar för patientsäker vård.

source: Assessment of co-morbidity with other psychiatric disorders and initiation of pharmacological treatment.
sv: Möjlighet till utredning av samsjuklighet av andra psykiatriska tillstånd och initiering av läkemedelsbehandling.

source: Neuro-psychiatric assessment for differential diagnostic purposes and commencement of medication if needed.
sv: Neuropsykiatrisk utredning i differentiell diagnostiskt syfte och insättning av läkemedel vid behov.

source: Team of doctors
sv: Läkarteam

source: Currently we have 4 psychiatrists on site (two of these are Swedish citizens and trained in Sweden). In additions to this, two psychiatrists are available for digital sessions. These two will sometimes also be present on site.
sv: I dagsläget har vi fyra psykiater på plats (varav två är svenska medborgare och utbildade i Sverige). Utöver det har vi två psykiater tillgängliga för digitala sessioner, men som även kommer att befinna sig på plats periodvis.

source: Other staff on site
sv: Övrig personal på plats

source: Therapist with specialist training in the 12-step program.
sv: Terapeut med specialistkompetens inom 12-stegsbehandling

source: Psychologist and occupational therapist (English speaking, recruitment of Swedish speaking staff is ongoing).
sv: Psykolog och arbetsterapeut (engelsktalande men det pågår rekrytering av svensktalande personer)

source: Yoga instructor (part-time 3 times a week plus weekends for those patients who are not participating in outings).
sv: Yogainstruktör (deltid 3 gånger per vecka plus 1 helgdag för de grupper som inte deltar i utflykter)

source: Contact person (Swedish speaking).
sv: Kontaktperson (svensktalande)

source: Minibus with driver.
sv: Minibuss med chaufför

source: Physiotherapist for medicinal massage.
sv: Fysioterapeut/sjukgymnast för medicinsk massage

source: Art therapy.
sv: Konst- och bildterapi

source: Crafts.
sv: Hantverk

source: Discussion and reading groups.
sv: Diskussions- och läsningsgrupp

source: Film group.
sv: Filmvisningsgrupp

source: Daily schedule
sv: Dagligt schema

source: Breakfast.
sv: Frukost

source: Medical round.
sv: Läkarbesök/Rond

source: Visit to doctor.
sv: Samtal med läkare

source: Rest.
sv: Vila

source: 12-step treatment (5 times per week).
sv: 12-stegsbehandling (5 gånger per vecka)

source: Yoga (3 times per week).
sv: Yoga (3 gånger per vecka)

source: Our staff
sv: Medarbetare

source: Website Privacy Notice
sv: Integritetspolicy

source: To the top
sv: Till toppen
